#include <iostream>
using namespace std;

void main()
{
	setlocale(LC_ALL, "");
	const int SIZE = 5;
	int arr[SIZE];

}
/*
ћассивы(Array) - набор переменный одного типа в непрерывной области пам€ти.
ћассив создают вс€кий раз, когда нужно объ€вить много однотипных переменных.
ѕеременными массивамми называют его элементами
ћассивы бывают:
-динамические
-статические
 ол-во элементов статического массива может быть задано лишь целочисленнными и константным значени€м и только на этапе написани€ кода.
–азмер статического массива невожно изменить после компил€ции.
 ол-во динамического массива может быть заданно переменным значением на этапе выполнени€ программы.
ѕредворительно это переменное значение можно вычеслить и перевести с клавиатуры.

“ак статические, так и динамические массивы бывают одномерные, двухмерные, трехмерные и т.д. многомерные.
 ол-во измерени€ массивов ничем не ограничиваетс€.

type name[SIZE];
tipe - тип элементов.
name - им€ массивов.
ƒл€ именовани€ массивов используетс€ такие же индификаторы, как при именовании переменных.
SIZE - кол-во элементов массива.
ћожет быть задано целочисленным, константным значени€м.

*/